app/Controllers/Frontend/HomeController.php

SELECT *
FROM `workshop`
WHERE `active` = '1'
---

        $modelWorkshop = new WorkshopModel();
        $modelWorkshop->select("workshop.*, (SELECT COUNT(*) FROM pendaftaran_workshop pw WHERE pw.id_workshop = workshop.id) as terpakai");
        $workshop = $modelWorkshop->where('active', '1')->findAll();